constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//mu		[1 -1 -1 0 0 0 0]     0.012;
nu              [0 2 -1 0 0 0 0]      0.001;		// kinematic visc.
rho		[1 -3 0 0 0 0 0]      1420.0;		// density 
alpha		[0 2 -1 0 0 0 0]      0.0002;		// thermal diffusivity
mu0	        [1 1 -2 0 0 -2 0]     1.256e-6;		// vacuum mag. permeab.
vf		[0 0 0 0 0 0 0]	      0.20;		// mag. particle vol. conc.
tb 		[0 0 1 0 0 0 0]       0.001;		// Brownian relaxation time
Md		[0 -1 0 0 0 1 0]      1.0e-7;		// magfluid solid magnet.
m		[0 2 0 0 0 -1 0]      2.71e-19;		// magnetic dipole int.
Kb		[1 2 -2 -1 0 0 0]     1.38e-23;		// Boltzmann constant
lambda		[0 0 0 0 0 0 0]        5.0;		// dipole interactions



// ************************************************************************* //
